# Manipulating Data Frames with Pandas

In [1]:
# Import modules
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

In [2]:
# Read from a file 
df = pd.read_csv('iris.csv')
# df = pd.read_csv(filename, index_col='column-name')

# Print the info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal.length    150 non-null float64
sepal.width     150 non-null float64
petal.length    150 non-null float64
petal.width     150 non-null float64
variety         150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [3]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

## Indexing

In [4]:
# Select firts entry in the first column
df.loc[0, 'sepal.length'] # 0 is the row name

5.1

The code below will give the same output.

In [5]:
# Select firts entry in the first column
df.iloc[0, 0] # 0's are index numbers

5.1

In [6]:
# Select two columnns
df[['sepal.length', 'sepal.width']].head()

   sepal.length  sepal.width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2
3           4.6          3.1
4           5.0          3.6

## Slicing

In [7]:
df.loc[0:5, 'sepal.length':'petal.length']

   sepal.length  sepal.width  petal.length
0           5.1          3.5           1.4
1           4.9          3.0           1.4
2           4.7          3.2           1.3
3           4.6          3.1           1.5
4           5.0          3.6           1.4
5           5.4          3.9           1.7

In [8]:
# Print data in reverse column order.
df.loc[0:5, 'petal.length':'sepal.length':-1]

   petal.length  sepal.width  sepal.length
0           1.4          3.5           5.1
1           1.4          3.0           4.9
2           1.3          3.2           4.7
3           1.5          3.1           4.6
4           1.4          3.6           5.0
5           1.7          3.9           5.4

In [9]:
# Slice columns
df.loc[:,:'petal.length'].head()

   sepal.length  sepal.width  petal.length
0           5.1          3.5           1.4
1           4.9          3.0           1.4
2           4.7          3.2           1.3
3           4.6          3.1           1.5
4           5.0          3.6           1.4

## Filtering

In [10]:
# Create a boolean array of the condition where sepal.length < 4.8
bool_arr = df['sepal.length']<4.8
bool_arr.head()

0    False
1    False
2     True
3     True
4    False
Name: sepal.length, dtype: bool

In [11]:
# Filter the df with a boolean array
df[bool_arr]

    sepal.length  sepal.width  petal.length  petal.width variety
2            4.7          3.2           1.3          0.2  Setosa
3            4.6          3.1           1.5          0.2  Setosa
6            4.6          3.4           1.4          0.3  Setosa
8            4.4          2.9           1.4          0.2  Setosa
13           4.3          3.0           1.1          0.1  Setosa
22           4.6          3.6           1.0          0.2  Setosa
29           4.7          3.2           1.6          0.2  Setosa
38           4.4          3.0           1.3          0.2  Setosa
41           4.5          2.3           1.3          0.3  Setosa
42           4.4          3.2           1.3          0.2  Setosa
47           4.6          3.2           1.4          0.2  Setosa

In [12]:
df[df.variety=='Setosa'].head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

## Filtering with NaNs

For the purpose of data manipulation, we'll now assign `np.nan` to the _sepal.length_ column where the legth is excatly 4.8.

In [13]:
df.loc[df['sepal.length']==4.8, 'sepal.length'] = np.nan

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
sepal.length    145 non-null float64
sepal.width     150 non-null float64
petal.length    150 non-null float64
petal.width     150 non-null float64
variety         150 non-null object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB

In [15]:
df.shape

(150, 5)

The method `.dropna()` is used to remove rows with missing data.

In [16]:
#  Remove rows where 'any' of the columns contains missing data
df.dropna(how='any').shape

(145, 5)

In [17]:
#  Remove rows where 'all' of the columns contains missing data
df.dropna(how='all').shape

(150, 5)

We can specify a threshold `thresh` and axis (column) to drop the the whole column if there are less non-missing values than the threshold.

In [18]:
# Drop columns with less than 150 non-missing values
df.dropna(thresh=150, axis='columns').shape

(150, 4)

## Transforming

### Apply

The `.apply()` method can be used  to apply a function along an axis to every element on a Data Frame.

The lengths in dataset is in centimeters. First, let's write a function which converts centimeters to inches.

In [19]:
# Create a function for cm to inch conversion
def cm_to_inch (cm):
    return cm * 0.393701

We can now apply this function over 'sepal.width' column of the iris dataset with the `.apply()` method.

In [20]:
df['sepal.width'].apply(cm_to_inch).head()

0    1.377954
1    1.181103
2    1.259843
3    1.220473
4    1.417324
Name: sepal.width, dtype: float64

In [21]:
df['sepal.width'].head()

0    3.5
1    3.0
2    3.2
3    3.1
4    3.6
Name: sepal.width, dtype: float64

### Map

`.map()` method is used for substituting each value in a Series with another value, that may be derived from a function, a dict or a Series.

We'll create a dictionary for a look-up.

In [22]:
# Unique values in 'variety' column
df.variety.unique()

array(['Setosa', 'Versicolor', 'Virginica'], dtype=object)

In [23]:
# Create a dictionary
colors = {'Setosa':'red', 'Virginica':'blue', 'Versicolor':'green'}

# map the 'variety' column to the a column
df['colors'] = df['variety'].map(colors)
df.colors.unique()

array(['red', 'green', 'blue'], dtype=object)

In [24]:
df.head()

   sepal.length  sepal.width  petal.length  petal.width variety colors
0           5.1          3.5           1.4          0.2  Setosa    red
1           4.9          3.0           1.4          0.2  Setosa    red
2           4.7          3.2           1.3          0.2  Setosa    red
3           4.6          3.1           1.5          0.2  Setosa    red
4           5.0          3.6           1.4          0.2  Setosa    red

### Vectorized Functions

It is better to use vectorized functions instead of `.apply()` and `.map()` to achieve better performance. NumPy, SciPy and pandas come with a variety of vectorized fast element-wise array functions. These called Ucalled Universal Functions in NumPy.

>The efficiency of several methodologies for applying a function to a Pandas DataFrame, from slowest to fastest:
1. Crude looping over DataFrame rows using indices
2. Looping with `iterrows()`
3. Looping with `apply()`
4. Vectorization with Pandas series
5. Vectorization with NumPy arrays
[source](https://engineering.upside.com/a-beginners-guide-to-optimizing-pandas-code-for-speed-c09ef2c6a4d6)

In [25]:
type(df['sepal.length']), type(df['sepal.length'].values)

(pandas.core.series.Series, numpy.ndarray)

## Advanced Indexing

In [26]:
df.index

RangeIndex(start=0, stop=150, step=1)

Indexes are immutable objects. That is, if we want to change an index, we'll need to change the whole index. We can do that with a list comprehension.

In [27]:
# Modify the index of the DataFrame so that the first observation start with 1 instead of 0
df.index = [i + 1 for i in df.index]

In [28]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            141, 142, 143, 144, 145, 146, 147, 148, 149, 150],
           dtype='int64', length=150)

We can also use `range` to create an index from a range object.

In [29]:
df.index = range(1,151)

In [30]:
df.index

RangeIndex(start=1, stop=151, step=1)

In [31]:
df.head(3)

   sepal.length  sepal.width  petal.length  petal.width variety colors
1           5.1          3.5           1.4          0.2  Setosa    red
2           4.9          3.0           1.4          0.2  Setosa    red
3           4.7          3.2           1.3          0.2  Setosa    red

In [32]:
# Assign strings 'Obs #' and '' to Data Frame
df.index.name = 'Obs #'
df.columns.name = 'Vars'

In [33]:
df.head(3)

Vars   sepal.length  sepal.width  petal.length  petal.width variety colors
Obs #
1               5.1          3.5           1.4          0.2  Setosa    red
2               4.9          3.0           1.4          0.2  Setosa    red
3               4.7          3.2           1.3          0.2  Setosa    red

### Hierarchical Indexing - Multi-Index

In [34]:
# Print first observation (row)
df.loc[1]

Vars
sepal.length       5.1
sepal.width        3.5
petal.length       1.4
petal.width        0.2
variety         Setosa
colors             red
Name: 1, dtype: object

In [35]:
# Print first observation
df.loc[[1]]

Vars   sepal.length  sepal.width  petal.length  petal.width variety colors
Obs #
1               5.1          3.5           1.4          0.2  Setosa    red

In [36]:
# Print first and third observations
df.loc[[1, 3]]

Vars   sepal.length  sepal.width  petal.length  petal.width variety colors
Obs #
1               5.1          3.5           1.4          0.2  Setosa    red
3               4.7          3.2           1.3          0.2  Setosa    red

In [37]:
# Print from first to third observations
df.loc[1:3]

Vars   sepal.length  sepal.width  petal.length  petal.width variety colors
Obs #
1               5.1          3.5           1.4          0.2  Setosa    red
2               4.9          3.0           1.4          0.2  Setosa    red
3               4.7          3.2           1.3          0.2  Setosa    red

In [38]:
# Create a new column with numbers ranging from 1 to 150
df['#'] = range(1,151)

# Set the index to be the columns ['#', 'color']
df_multi = df.set_index(['#', 'colors'])
df_multi = df_multi.sort_index()

df_multi.head(3)

Vars      sepal.length  sepal.width  petal.length  petal.width variety
# colors
1 red              5.1          3.5           1.4          0.2  Setosa
2 red              4.9          3.0           1.4          0.2  Setosa
3 red              4.7          3.2           1.3          0.2  Setosa

In [39]:
# Look up data for ""(1,2), red" (first two rows)

df_multi.loc[((1,2), 'red'),:]

Vars      sepal.length  sepal.width  petal.length  petal.width variety
# colors
1 red              5.1          3.5           1.4          0.2  Setosa
2 red              4.9          3.0           1.4          0.2  Setosa

In [40]:
# Look up data for all obs in color blue (Virginica)
df_multi.loc[(slice(None), 'blue'),:].head(3)

Vars        sepal.length  sepal.width  petal.length  petal.width    variety
#   colors
101 blue             6.3          3.3           6.0          2.5  Virginica
102 blue             5.8          2.7           5.1          1.9  Virginica
103 blue             7.1          3.0           5.9          2.1  Virginica

## Reshaping & Rearranging

### Pivoting

The `.pivot()` method returns reshaped DataFrame organized by given index/column values.

In [41]:
# Create a Data Frame
df2 = pd.DataFrame({'Year': ['2018', '2019', '2018', '2019', '2018', '2019'], 'Country': ['Turkey', 'Turkey', 'USA', 'USA', 'Germany', 'Germany'], 'Pop': [1, 2, 3, 4, 5, 6], 'GDP': ['12', '34', '56', '78', '90', '123']})
df2

   Year  Country  Pop  GDP
0  2018   Turkey    1   12
1  2019   Turkey    2   34
2  2018      USA    3   56
3  2019      USA    4   78
4  2018  Germany    5   90
5  2019  Germany    6  123

In [42]:
df2.pivot(index='Year', columns='Country', values='GDP')

Country Germany Turkey USA
Year
2018         90     12  56
2019        123     34  78

In [43]:
df3 = df2.pivot(index='Year', columns='Country')
df3

            Pop                GDP
Country Germany Turkey USA Germany Turkey USA
Year
2018          5      1   3      90     12  56
2019          6      2   4     123     34  78

### Stacking & Unstacking

In [44]:
df3_stack = df3.stack()
df3_stack

              Pop  GDP
Year Country
2018 Germany    5   90
     Turkey     1   12
     USA        3   56
2019 Germany    6  123
     Turkey     2   34
     USA        4   78

In [45]:
df3_stack.unstack()

            Pop                GDP
Country Germany Turkey USA Germany Turkey USA
Year
2018          5      1   3      90     12  56
2019          6      2   4     123     34  78

### Melting

`.melt()` unpivots a DataFrame from wide format to long format. Columns specified with `id_vars` remain in the reshaped DataFrame, while columns specified with `value_vars` converted into values.

In [46]:
df2_melt = df2.pivot(index='Year', columns='Country', values='GDP')
df2_melt

Country Germany Turkey USA
Year
2018         90     12  56
2019        123     34  78

In [47]:
df2_melt = df2_melt.reset_index()
df2_melt

Country  Year Germany Turkey USA
0        2018      90     12  56
1        2019     123     34  78

In [48]:
df2_melt = pd.melt(df2_melt, id_vars=['Year'], value_name='Pop')
df2_melt

   Year  Country  Pop
0  2018  Germany   90
1  2019  Germany  123
2  2018   Turkey   12
3  2019   Turkey   34
4  2018      USA   56
5  2019      USA   78

Obtaining key-value pairs with `melt()`:

In [49]:
# Set the new index
df2_melt = df2_melt.set_index('Year')

# Obtain the key-value pairs
pd.melt(df2_melt, col_level=0)

   variable    value
0   Country  Germany
1   Country  Germany
2   Country   Turkey
3   Country   Turkey
4   Country      USA
5   Country      USA
6       Pop       90
7       Pop      123
8       Pop       12
9       Pop       34
10      Pop       56
11      Pop       78

[Manipulating DataFrames with Pandas - Part 2 (Grouping Data)](https://github.com/kaymal/Python/blob/master/Python%20for%20Data%20Science/Manipulating%20DataFrames%20with%20Pandas%20-%202%20(Grouping%20Data).ipynb)